### AWS  App plan Part # 3
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "public-read"%0A      + bucket                 = "uat.marshmallowmeat.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "index.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../shortpoet_site/index.html"%0A      + source_hash            = "addd68c3b53f697e3611492cd5204084"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.marshmallowmeat.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0APlan: 39 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + s3_bucket_object_etags       = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + s3_bucket_object_ids         = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + s3_bucket_object_keys_ids    = [%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/About-41cfd9b3.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/ArticleLayouts-0832ce36.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/Articles-c07800fd.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/Articles-cdca7afd.css"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/Landing-55994a62.css"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/Landing-c02f9a13.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/PDF-2166aad4.css"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/PDF-7827ee5f.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/Start-1478f226.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/StartButtonFloat-30662b5b.css"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/StartButtonFloat-75808506.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/Terminal-2e2ec67e.css"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/Terminal-e654d540.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/azure_devicon_forest_green-00278e7c.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/bash_devicon_forest_green-d16e0666.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/d3_devicon_forest_green-1e07de82.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/devicons-4cbd2440.woff"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/devicons-880373aa.eot"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/devicons-cbb92633.ttf"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/devicons-d7c9f264.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/fontawesome-webfont-2adefcbc.woff2"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/fontawesome-webfont-7bfcab6d.eot"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/fontawesome-webfont-aa58f33f.ttf"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/fontawesome-webfont-ad615792.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/fontawesome-webfont-ba0c59de.woff"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/github_profile_pic-66b10136.jpg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/html2canvas.esm-0a33ed42.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/index-79ca4b23.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/index-9a0f5c31.css"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/index.es-2ebeaddd.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/powershell_devicon_forest_green-25e7cded.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/purify.es-3ef59d4c.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/recase-b12b8868.js"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/tableau_logo-c0ec519e.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/terraform_devicon_forest_green-e8473ede.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/ts_devicon_forest_green-e8483eba.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "assets/vue_devicon_forest_green-d8b386fc.svg"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "favicon.ico"%0A        },%0A      + {%0A          + id  = (known after apply)%0A          + key = "index.html"%0A        },%0A    ]%0A  + s3_bucket_object_version_ids = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*